app/views/pets/new.html.erb

            <div class="field">
                カテゴリ<%= f.collection_select :genre_id, Genre.all, :id, :name, :prompt => "選択してください" %>
---
SELECT "genres".* FROM "genres"