app/views/posts/show.html.erb

                        <%= link_to post_favorites_path(@post), method: :delete do %>
                            ♥<%= @post.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]

                        <%= link_to post_favorites_path(@post), method: :post do %>
                            ♡<%= @post.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]


        <% @post.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]