app/controllers/favorites_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2021-02-27 23:20:03.109708"], ["updated_at", "2021-02-27 23:20:03.109708"]]
---
    def create
        @post = Post.find(params[:post_id])
        @favorite = current_user.favorites.new(post_id: @post.id)
        @favorite.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
    def destroy
        @post = Post.find(params[:post_id])
        @favorite = current_user.favorites.find_by(post_id: @post.id)
        @favorite.destroy