app/controllers/pets_controller.rb

    def create
        @pet = Pet.new(pet_params)
        @pet.sex = params[:pet][:sex].to_i
        @pet.user_id = current_user.id
        if @pet.save
---
INSERT INTO "pets" ("name", "introduction", "sex", "age", "image_id", "user_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)