app/controllers/post_comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @post_comments = PostComment.all
        @post_comment = current_user.post_comments.new(post_comment_params)
        @post_comment.post_id = @post.id
        @post_comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
INSERT INTO "post_comments" ("post_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["body", "かめちゃん可愛いですね！"], ["created_at", "2021-02-27 22:31:34.993216"], ["updated_at", "2021-02-27 22:31:34.993216"]]

    def destroy
        @post = Post.find(params[:post_id])
        @post_comments = PostComment.all
        @post_comment = PostComment.find_by(id: params[:id], post_id: params[:post_id])
        @post_comment.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."post_id" = ? LIMIT ?  [["id", 1], ["post_id", 1], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]