app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save
---
INSERT INTO "posts" ("title", "body", "image_id", "user_id", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)