app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "updated_at" = ?, "image_id" = ? WHERE "users"."id" = ?  [["introduction", "okariやで\r\nokariやでったら\r\nokariやで"], ["updated_at", "2021-03-02 05:09:31.378616"], ["image_id", "49f42c2d84665082c367619d920f1b38e3ea4362561bdb565113a2d20193"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def pets_index
        @user = User.find(params[:id])