app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followee_id", 1], ["created_at", "2021-03-02 05:12:00.454020"], ["updated_at", "2021-03-02 05:12:00.454020"]]
SELECT "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = ? AND "relationships"."followee_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["follower_id", 2], ["followee_id", 1], ["follower_id", 2], ["LIMIT", 1]]
---
        def follow(another_user)
          unless self == another_user
            self.relationships.find_or_create_by(followee_id: another_user.id, follower_id: self.id)

SELECT "relationships".* FROM "relationships" WHERE "relationships"."follower_id" = ? AND "relationships"."followee_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["follower_id", 2], ["followee_id", 1], ["follower_id", 2], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
        def unfollow(another_user)
          unless self == another_user
            relationship = self.relationships.find_by(followee_id: another_user.id, follower_id: self.id)
            relationship.destroy if relationship